## Plan Result (stg_backendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw"
        name                              = "aks00-stg-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/darts-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "darts-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/darts-gateway" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "darts-gateway" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/darts-stub-services" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "darts-stub-services" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/lgy-iac-web" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "lgy-iac-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-account-management" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-account-management" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-business-rules" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-business-rules" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-channel-management" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-channel-management" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-data-management" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-data-management" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-publication-services" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-publication-services" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-subscription-management" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pip-subscription-management" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pre-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pre-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pre-portal" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "pre-portal" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/toffee-recipe-backend" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "toffee-recipe-backend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-bookings-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-bookings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-notification-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-notification-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-test-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-test-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-user-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-user-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-video-api" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-video-api" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "darts-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "darts-gateway"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "darts-stub-services"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "lgy-iac-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-account-management"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-business-rules"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-channel-management"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-data-management"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-publication-services"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pip-subscription-management"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pre-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "pre-portal"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "toffee-recipe-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "vh-bookings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "vh-notification-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "vh-test-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "vh-user-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.31.250",
            ]
          + name         = "vh-video-api"
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (81 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":566,"Program":"tfcmt","SHA1":"","Target":"stg_backendappgateway","Vars":{}} -->